// tslint:disable:object-literal-key-quotes max-line-length
export default {
  //***********Pages***********
  // Home.vue
  '더이상 없습니다.': '더이상 없습니다.',

  //Collection
  '없다.': '없다.',
  '무한 스크롤용 로딩 ui': '무한 스크롤용 로딩 ui',

  //EditPost
  '게시물 수정': '게시물 수정',
  '취소': '취소',
  '확인': '확인',
  '게시물이 존재하지 않거나 접근할 권한이 없습니다.': '게시물이 존재하지 않거나 접근할 권한이 없습니다.',
  
  //ErrorPage
  '로그인 다시 하기': '로그인 다시 하기',

  //Login
  'LINEUP 계정명 또는 email': 'LINEUP 계정명 또는 email',
  '비밀번호': '비밀번호',
  '비밀번호를 입력해주세요': '비밀번호를 입력해주세요',
  'E-mail 주소나 비밀번호가 일치하지 않습니다': 'E-mail 주소나 비밀번호가 일치하지 않습니다',
  '라인업 계정으로 로그인 또는 가입': '라인업 계정으로 로그인 또는 가입',
  '스팀잇 계정으로 로그인 또는 가입': '스팀잇 계정으로 로그인 또는 가입',
  'Remember me': 'Remember me',

  //OnMaintenance
  '서비스 점검 중입니다.': '서비스 점검 중입니다.',
  '더 나은 서비스 제공을 위해 서버 확장 중입니다.': '더 나은 서비스 제공을 위해 서버 확장 중입니다.',
  '스팀 계정 인증 오류': '스팀 계정 인증 오류',
  '스팀 계정으로부터 부정확한 인증 정보가 전달되어 로그인에 실패했습니다.': '스팀 계정으로부터 부정확한 인증 정보가 전달되어 로그인에 실패했습니다.',
  '요청하신 페이지를 찾을 수 없습니다.': '요청하신 페이지를 찾을 수 없습니다.',
  '소셜 계정 인증 오류': '소셜 계정 인증 오류',
  '소셜 계정 인증 중 인증 제공자로부터 인증이 거절되어 로그인에 실패했습니다.': '소셜 계정 인증 중 인증 제공자로부터 인증이 거절되어 로그인에 실패했습니다.',

  //PostDetail
  '님이 좋아합니다.': '님이 좋아합니다.',
  '님,': '님,',
  '게시물이 존재하지 않습니다.': '게시물이 존재하지 않습니다.',
  '링크복사': '링크복사',
  '수정': '수정',
  '삭제': '삭제',
  '스팸입니다.': '스팸입니다.',
  '부적절합니다.': '부적절합니다.',
  '신고': '신고',
  '해당 게시물을 [': '해당 게시물을 [',
  '스팸 게시물': '스팸 게시물',
  '부적절한 게시물': '부적절한 게시물',
  ']로 신고할까요?': ']로 신고할까요?',
  '신고하기': '신고하기',

  //Profile
  '팔로워': '팔로워',
  '팔로잉': '팔로잉',
  '게시한 이미지가 없습니다.': '게시한 이미지가 없습니다.',
  '생성한 컬렉션이 없습니다.': '생성한 컬렉션이 없습니다.',

  //PromotionCOde
  '쿠폰 코드': '쿠폰 코드',
  '쿠폰 코드를 입력하세요.': '쿠폰 코드를 입력하세요.',
  '등록': '등록',

  //Search
  '게시물': '게시물',
  '개': '개',
  '검색 결과 없음': '검색 결과 없음',

  //SearchResult
  '검색 결과': '검색 결과',
  '에 연결된 게시물이 없습니다.': '에 연결된 게시물이 없습니다.',

  //Profile
  '로그아웃': '로그아웃',
  '이메일': '이메일',
  '아이디': '아이디',
  '유저네임': '유저네임',
  '이름이 설정되어 있지 않습니다.': '이름이 설정되어 있지 않습니다.',
  '나의 추천인 코드': '나의 추천인 코드',
  '스팀잇 아이디 연결': '스팀잇 아이디 연결',
  'Login with SteemConnect': 'Login with SteemConnect',
  '계정으로 연결함': '계정으로 연결함',
  '연동이 만료되었습니다. 다시 연동하세요.': '연동이 만료되었습니다. 다시 연동하세요.',
  '스팀잇 아이디': '스팀잇 아이디',
  '알림 설정': '알림 설정',
  '좋아요': '좋아요',
  '댓글': '댓글',
  '새 팔로워': '새 팔로워',
  '새 게시물': '새 게시물',
  '선택': '선택',

  //SignUp
  'E-mail': '이메일',
  'Confirm E-mail': '이메일 확인',
  'Password': '비밀번호',
  'Confirm Password': '비밀번호 확인',
  'Referral Code': '추천인 코드',
  '회원가입': '회원가입',

  //TopPage
  '지금 시작하세요!': '지금 시작하세요!',
  '시작하기': '시작하기',
  '로그인': '로그인',

  //Wallet
  '라인업 마일리지':'라인업 마일리지',
  '스팀':'스팀',
  '스팀 달러':'스팀 달러',
  '스팀 파워':'스팀 파워',
  '보팅 파워':'보팅 파워',

  //***********Components***********
  // UploadForm.vue
  '로그인 후 업로드 가능합니다.': '로그인 후 업로드 가능합니다.',
  '권한이 없거나 게시물 생성 요청을 실패하였습니다.': '권한이 없거나 게시물 생성 요청을 실패하였습니다.',
  '크기가 500*500 미만이거나 포맷에 문제가 있는 이미지는 업로드 할 수 없습니다.' :'크기가 500*500 미만이거나 포맷에 문제가 있는 이미지는 업로드 할 수 없습니다.',

  //ButtonFollow.vue
  'Follow':'Follow',
  'UnFollow':'UnFollow',
  '팔로잉하지 못했습니다. 이 문제가 계속된다면 contact@line-up.me 로 문의 바랍니다.': '팔로잉하지 못했습니다. 이 문제가 계속된다면 contact@line-up.me 로 문의 바랍니다.',

  //CollectionManager.vue
  '저장 위치':'저장 위치',
  '만들어 놓은 컬렉션이 없습니다.':'만들어 놓은 컬렉션이 없습니다.',
  '오른쪽 위 + 기호를 눌러 컬렉션을 추가해 보세요.':'오른쪽 위 + 기호를 눌러 컬렉션을 추가해 보세요.',
  '새 컬렉션':'새 컬렉션',

  //NavigationBar.vue
  '사진':'사진',
  '팔로잉 소식':'팔로잉 소식',
  '보상 소식':'보상 소식',
  '내 핀 검색':'내 핀 검색',
  '설정':'설정',
  '내 지갑':'내 지갑',
  'LINEUP':'LINEUP',

  //NotificationItem.vue
  '님이 새로운 게시물을 올렸습니다.':'님이 새로운 게시물을 올렸습니다.',
  '내가 보팅한 게시물에':'내가 보팅한 게시물에',
  '님도 보팅하였습니다.':'님도 보팅하였습니다.',
  '내가 댓글 남긴 게시물에':'내가 댓글 남긴 게시물에',
  '님도 댓글을 남겼습니다.':'님도 댓글을 남겼습니다.',
  '내 게시물에':'내 게시물에',
  '님이 댓글을 남겼습니다.':'님이 댓글을 남겼습니다.',

  //Upload.vue
  '이미지 올리기':'이미지 올리기',

  //Setting
  '복사':'복사',
  '추천코드가 복사되었습니다.':'추천코드가 복사되었습니다.',
  '에러가 발생했습니다.':'에러가 발생했습니다.',

};
